In [3]:
import pandas as pd

In [2]:
#A série do Pandas pode optar por fazer indicies usando chaves como um dcionário
lista = [12, 23, 34, 49, 56, 67]
serie_pandas = pd.Series(lista)

In [11]:
print(serie_pandas)

0    12
1    23
2    34
3    49
4    56
5    67
dtype: int64

In [4]:
notas = {"Leo" : 9.5, "Joao" : 6.5, "Amanda" : 7.8}
series_notas = pd.Series(notas)

In [5]:
print(series_notas)

Leo       9.5
Joao      6.5
Amanda    7.8
dtype: float64

In [8]:
#O pandas é construido com base no numpy, ou seja ele implementa mais funcoes que ele 
#como a mediana ou uma descricao completa
print(series_notas.median())
print(series_notas.describe())

7.8
count    3.000000
mean     7.933333
std      1.504438
min      6.500000
25%      7.150000
50%      7.800000
75%      8.650000
max      9.500000
dtype: float64

In [38]:
dic = {"Alunos" : ["Leonardo", "Amanda", "Lucas", "Rafael"],
      "Curso" : ["Computacao", "Psicologia", "Computacao", "Computacao"],
       "Notas": ["MS", "SS", "MS", "MI"]
      }

In [39]:
df = pd.DataFrame(dic)
df

     Alunos       Curso Notas
0  Leonardo  Computacao    MS
1    Amanda  Psicologia    SS
2     Lucas  Computacao    MS
3    Rafael  Computacao    MI

In [40]:
#Para via de análise de dados futuros vamos transformar a coluna de Notas em uma nova coluna com suas respectivas notas em inteiros
Notas_int = []
for i in df["Notas"]:
    if i == "SS":
        Notas_int.append(10)
    elif i == "MS":
        Notas_int.append(8)
    elif i == "MM":
        Notas_int.append(6)
    elif i == "MI":
        Notas_int.append(4)
    else:
        Notas_int.append(0)

df = df.assign(Notas_int = Notas_int)
df

     Alunos       Curso Notas  Notas_int
0  Leonardo  Computacao    MS          8
1    Amanda  Psicologia    SS         10
2     Lucas  Computacao    MS          8
3    Rafael  Computacao    MI          4

In [41]:
#Média das Notas
print("Médias das notas: ", df["Notas_int"].mean())
#Para calcular as médias das notas dos alunos de computacao podemos utilizar de mascaras que vimos em series
mask = (df["Curso"] == "Computacao")
alunos_computacao = df[mask]
# alunos_computacao
print("Média alunos de Computacao: ", alunos_computacao["Notas_int"].mean())

Médias das notas:  7.5
Média alunos de Computacao:  6.666666666666667

In [42]:
#Introduzindo um novo Aluno ao DataFrame
df = df._append({"Alunos" : "Anthony", "Curso" : "Psicolog", "Notas" : "MM", "Notas_int" : 6}, ignore_index = True)
df

     Alunos       Curso Notas  Notas_int
0  Leonardo  Computacao    MS          8
1    Amanda  Psicologia    SS         10
2     Lucas  Computacao    MS          8
3    Rafael  Computacao    MI          4
4   Anthony    Psicolog    MM          6

In [58]:
#Escrevemos psicologia errado, podemos corrigir isso atraves de uma mascara
mascara_correta = df["Curso"] == "Psicolog"
df.loc[mascara_correta, 'Curso'] = "Psicologia"
df

     Alunos       Curso Notas  Notas_int
0  Leonardo  Computacao    MS          8
1    Amanda  Psicologia    SS         10
2     Lucas  Computacao    MS          8
3    Rafael  Computacao    MI          4
4   Anthony  Psicologia    MM          6

In [59]:
df["Alunos"] == "Leonardo"

0     True
1    False
2    False
3    False
4    False
Name: Alunos, dtype: bool

In [61]:
df[df["Alunos"] == "Leonardo"]['Curso']

0    Computacao
Name: Curso, dtype: object